InformationRegisters/ЦС_ОрганизацииЦентральнойБазыДляОбщегоУчетаИнвентарныхНомеров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ЦС_ОрганизацииЦентральнойБазыДляОбщегоУчетаИнвентарныхНомеров</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Префикс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ПервоначальныеСведенияОСБухгалтерскийУчет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ПервоначальныеСведенияОСБухгалтерскийУчет</Name>
			<Comment>(Регл) Регистр, который показывает изменение инвентарного номера ОС при передаче его из одной организации в другую. Информация записывается только документами ПринятиеКУчету по бух. виду учета и ввод остатков</Comment>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИнвентарныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособПоступления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыПоступленияАктивов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПервоначальнаяСтоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособНачисленияАмортизации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыНачисленияАмортизацииОС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПараметрВыработки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПараметрыВыработкиОС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтруктурноеПодразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОсновноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonModules/ЦС_ПрефиксацияИнвентарныхНомеров/Ext/Module.bsl
//Получает инвентарный номер в зависимости от организации, указанной в документе принятия к учету
//Параметры:	<МассивОрганизаций> - массив организаций, где учет ведется в одной базе
//				<Организация>		- текущая организация
//				<ОС>				- Анализируемое основное средство
//				<ТаблицаОС>			- таблица с новыми активами
//				<Период>				- дата среза для регистра с инв. номерами
Функция ПолучитьИнвентарныйНомер(МассивОрганизаций, Организация, ОС, ТаблицаОС, Период) Экспорт
	
	Если МассивОрганизаций.Количество() = 0 тогда
		
		//Заполняем массив организаций, где учет ведется в одной базе
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЦС_ОрганизацииЦентральнойБазыДляОбщегоУчетаИнвентарныхНомеров.Организация
		|ИЗ
		|	РегистрСведений.ЦС_ОрганизацииЦентральнойБазыДляОбщегоУчетаИнвентарныхНомеров КАК ЦС_ОрганизацииЦентральнойБазыДляОбщегоУчетаИнвентарныхНомеров";
		
		МассивОрганизаций = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Организация");
		
	КонецЕсли;
	
	Если МассивОрганизаций.Найти(Организация)=Неопределено тогда
		
		//Организация находится не в этой базе. Можно смело присваивать инвентарный номер согласно кода
		Возврат ОС.Код;
	КонецЕсли; 	
	
	Если ТаблицаОС.Количество() = 0 тогда
		
		//Заполняем таблицу ОС и инв номеров по текущей организации	
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИнвНом.ОсновноеСредство,
		|	ИнвНом.ИнвентарныйНомер КАК ИнвентарныйНомер
		|ИЗ
		|	РегистрСведений.ПервоначальныеСведенияОСБухгалтерскийУчет.СрезПоследних КАК ИнвНом
		|ГДЕ
		|	ИнвНом.Организация = &Организация";
		
		Запрос.УстановитьПараметр("Организация", Организация);
		Запрос.УстановитьПараметр("Период",		 Период);
		
		Результат = Запрос.Выполнить();
		
		ТаблицаОС = Результат.Выгрузить();		
		
		Для Каждого строкаТЧ из ТаблицаОС Цикл
			
			ЦифрыИН = сред(строкаТЧ.ИнвентарныйНомер,3);
			
			ДлинаИнвНом = СтрДлина(ЦифрыИН);
			
			Для Сч = ДлинаИнвНом по 10 Цикл
				ЦифрыИН = "0" + ЦифрыИН;				
			КонецЦикла;			
			
			СтрокаТЧ.ИнвентарныйНомер = ЦифрыИН;
			
		КонецЦикла;
		
		ТаблицаОС.Сортировать("ИнвентарныйНомер Возр");
		
	КонецЕсли;  
	
	СтрокаТЧ = ТаблицаОС.Найти(ОС);
	
	Если СтрокаТЧ = Неопределено тогда
		
		КоличествоСтрок = ТаблицаОС.Количество();
		ПоследняяСтрока = ТаблицаОС[КоличествоСтрок-1];
		ПоследнийИнвНом = число(Сред(ПоследняяСтрока.ИнвентарныйНомер,3));
		Префикс = Сред(ОС.Код,1,2);
		НовыйИнвНом	= Префикс + Формат(ПоследнийИнвНом+1,"ЧЦ=9; ЧВН=; ЧГ=0");
		СтрокаТЧ = ТаблицаОС.Добавить();
		СтрокаТЧ.ОсновноеСредство = ОС;
		СтрокаТЧ.ИнвентарныйНомер = НовыйИнвНом;
		
		возврат НовыйИнвНом;
		
	Иначе
		
		Возврат СтрокаТЧ.ИнвентарныйНомер;
		
	КонецЕсли;
	
	
	
КонецФункции
